;================================================================================================================
; подпрограмма преобразования ascii '4','1'-> hex кода 41h
; 
; вх r17h,r18l
; вых старш r17
; 
;================================================================================================================
ascii_to_hex:
					cpi		r17,0x41		; буква ?
					brsh	ascii_to_hex0   ; да

					ldi		r16,0x30		; значит цифра
					sub		r17,r16

					jmp 	ascii_to_hex1
ascii_to_hex0:
					ldi		r16,0x37
					sub		r17,r16
ascii_to_hex1:
					swap	r17


					cpi		r18,0x41		; буква ?
					brsh	ascii_to_hex2   ; да

					ldi		r16,0x30		; значит цифра
					sub		r18,r16

					jmp 	ascii_to_hex3
ascii_to_hex2:
					ldi		r16,0x37
					sub		r18,r16
ascii_to_hex3:

					add		r17,r18

					ret
;------------------------------------------------------------------------------
;.dseg
;decode_pdu_in_str:  .byte (140-1)+1  ;входной массив MAX длинна сообшения
;decode_txt_out_str: .byte (160-1)+1+1  ;выходной массив MAX длинна Выходного сообшения
; самые первые байты длинна последовательности

;.cseg
;================================================================================================================
