;================================================================================================================
;	подпрограмма копирывания строки из EEPROM -> RAM
;										Z		  Y
;	0 байт длинна строки (копирует БЕЗ длинны строки)	
;================================================================================================================
copy_eeprom_ram_nolen:

					ldi			r18,0x00			; счетчик количества скопированых байт

					call		eeprom_read_byte
					adiw		zl,0x01				; z+1

					;st			y+,r16				; переписали длинну строки

					mov 		r17,r16				; 17 сколько всего надо скопирывать байт

copy_eeprom_ram_nolen0:
					call		eeprom_read_byte	; прочитали
					adiw		zl,0x01				; z+1
					st			y+,r16				; переписали байт

					inc			r18					; счетчик +1

					cp			r18,r17
					breq 		copy_eeprom_ram_nolen1
			
					jmp			copy_eeprom_ram_nolen0



copy_eeprom_ram_nolen1:

ret
;================================================================================================================
