;================================================================================================================
;подпрограмма  копирывания ASCII строки из ROM в RAM
;	Z - адрес выводимой строки
; выводим пока невстретим код $00	
; выводим из ROM  
;
;================================================================================================================
.equ	str_end_coder=0x00	;код конца обработки строки на свое усмотрение

copy_str_to_ram:
;					clr 	r16
;					out		rampz,r16

copy_str_to_ram_0:
					lpm	r16,z+					;берем первый символ из памяти(в цикле следующий символ)

					cpi		r16,str_end_coder	;здесь может быть любой код завершения строки
					breq	copy_str_to_ram_exit
					
					st		y+,r16				; сохраняем

					rjmp	copy_str_to_ram_0

copy_str_to_ram_exit:
					ret
;================================================================================================================
