;================================================================================================================
;	подпрограмма записи байта в EEPROM
;	
; 	Z   - адресс записи
;	R16 - записываемый байт
;
;
;
;================================================================================================================
eeprom_read_byte:
;					cli			; запрещаем прерывания
_eeprom_read_wait0:
					sbic		EECR,EEPE			;ждем завершения предыдущей записи
					jmp 		_eeprom_read_wait0

					out			EEARH,zh			;заносим адрес
					out			EEARL,zl

					sbi			EECR,EERE			;eemwe=1 en read
;					sbi			EECR,EEWE			; read start

					in			r16,EEDR			;data

;					sei			; разрешаем прерывания

ret
;================================================================================================================
