;================================================================================================================
;	подпрограмма записи байта в EEPROM
;	
; 	Z   - адресс записи
;	R16 - записываемый байт
;
;
;
;================================================================================================================
eeprom_write_byte:
					;cli			; запрещаем прерывания
_eeprom_write_wait0:
					sbic		EECR,EEPE			;ждем завершения предыдущей записи
					jmp 		_eeprom_write_wait0

					out			EEARH,zh			;заносим адрес
					out			EEARL,zl

					out			EEDR,r16			;data

					cbi			EECR,EEPM0
					cbi			EECR,EEPM1			; set rehim = (erase+write)


					sbi			EECR,EEMPE			;eempe=1 en write
					sbi			EECR,EEPE			; write start

					;sei			; разрешаем прерывания

ret
;================================================================================================================
