;==================================================================================
;	ѕрограмма кодировки нех дл€ вывода на индикатор
;   сдвигаем старший разр€д первым
;	от 0...F
;	R17 - входное(младша€ часть) и выводимое значение
;==================================================================================

;==================================================================================
hex_shift_code:
				ldi		zl,low (codes_hex*2)
				ldi		zh,high (codes_hex*2)

				andi	r17,0x0f	; чистим на вс€кий случай

				clc					; z = z + r17(low)
				ldi		r16,0x00
				add		zl,r17
				adc		zh,r16

				lpm		r17,z

ret
;				0	  1    2    3    4    5    6    7    8    9    a    b    c    d    e    f
codes_hex: .db 0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,0x90,0x88,0x83,0xc6,0xa1,0x86,0x8e
;==================================================================================
