;================================================================================================================
; подпрограмма преобразования hex кода 41h -> ascii '4','1'
; 
; вх r16
; вых старш r24
; вых младший r25
; 
;================================================================================================================
;.equ	str_end_code=0x00	;код конца обработки строки на свое усмотрение

;.def		hex_to_ascii_a = r16
;.def		hex_to_ascii_b = r24
;.def		hex_to_ascii_c = r25

hex_to_ascii:
					mov r24,r16
					mov r25,r16

					ldi		r16,0x0f
					
					swap	r24
					and 	r24,r16 ;выд тетрады

					and		r25,r16 ;выд тетрады


					
					cpi		r24,0x0a		; буква ?
					brsh	hex_to_ascii0   ; да

					ldi		r16,0x30		; значит цифра
					add		r24,r16

					jmp 	hex_to_ascii1
hex_to_ascii0:
					ldi		r16,0x37
					add		r24,r16
hex_to_ascii1:


					cpi		r25,0x0a		; буква ?
					brsh	hex_to_ascii2   ; да

					ldi		r16,0x30		; значит цифра
					add		r25,r16

					jmp 	hex_to_ascii3
hex_to_ascii2:
					ldi		r16,0x37
					add		r25,r16
hex_to_ascii3:

					ret
;------------------------------------------------------------------------------
;.dseg
;decode_pdu_in_str:  .byte (140-1)+1  ;входной массив MAX длинна сообшения
;decode_txt_out_str: .byte (160-1)+1+1  ;выходной массив MAX длинна Выходного сообшения
; самые первые байты длинна последовательности

;.cseg
;================================================================================================================
