;==================================================================================
;	Вывод символа в текущею позицию на LCD DV-16230
; 
; 	r17
;==================================================================================
lcd_write_char:

;записываем в память символы
;			sbi		lcd_control_port,lcd_rs				;RS=1
			lds		r16,lcd_dc_port
			ori		r16,(1<<lcd_rs)
			sts		lcd_dc_port,r16

			;ldi		r17,0x38
			call	lcd_write_byte						;запись байта в ЖКИ

ret
;=================================================================================
