;================================================================================================================
;подпрограмма выдачи в СОМ порт строки байт из RAM
;	Y - адрес выводимой строки
;	Y+0 - количество байт в строке МЛ.байт
;================================================================================================================
tx_array_ram2:

					ldi			r18,0x00			; счетчик количества скопированых байт

					ld			r17,y+				; 17 сколько всего надо скопирывать байт

tx_array_ram20:
					ld			r16,y+				; выводимый байт в порт
					call		USART0_Tx

					inc			r18					; счетчик +1

					cp			r18,r17
					breq 		tx_array_ram21
			
					jmp			tx_array_ram20

tx_array_ram21:

				ret
;================================================================================================================
