;================================================================================================================
;подпрограмма выдачи в СОМ порт ASCII строки 
;	Z - адрес выводимой строки
; выводим пока невстретим код $00	
; выводим из ROM  
;
;================================================================================================================
.equ	str_end_code=0x00	;код конца обработки строки на свое усмотрение

tx_str_rom:
;					clr 	r16
;					out		rampz,r16

tx_str_rom_0:
					lpm	r16,z+				;берем первый символ из памяти(в цикле следующий символ)

					cpi		r16,str_end_code	;здесь может быть любой код завершения строки
					breq	tx_str_rom_exit
					
					call 	usart0_tx			; вх - r16

					rjmp	tx_str_rom_0

tx_str_rom_exit:
					ret
;================================================================================================================
